app/controllers/categories_controller.rb

  def index
    @houses = Category.includes(:houses)
---
SELECT "categories".* FROM "categories"
SELECT "houses".* FROM "houses"